<template>
	<div class="test-aplayer-view">
		<h1>播放器</h1>
		<VueAPlayer :music="songInfo" :autoplay="true" :showLrc="true" :float="true" listMaxHeight="300" :list="songsList"></VueAPlayer>
	</div>
</template>

<script>
	import VueAPlayer from './components/VueAPlayer'

	export default {
		name: "TestAplayer",
		components:{
			VueAPlayer,
		},
		data() {
			return {
				musicListData:[],
				// 音频配置
				songInfo: {
					title: '予你', //歌曲名称
					artist: '队长', //演唱者
					lrc: "[00:00.000] 作词 : 周杰伦\n[00:01.000] 作曲 : 周杰伦\n[00:02.000] 编曲 : 屠颖\n[00:23.74]半夜睡不着觉把心情哼成歌\n[00:29.15]只好到屋顶找另一个梦境\n[00:40.10]睡梦中被敲醒我还是不确定\n[00:45.55]怎会有动人旋律在对面的屋顶\n[00:51.10]我悄悄关上门带着希望上去\n[00:56.43]原来是我梦里常出现的那个人\n[01:00.74]那个人不就是我梦里\n[01:03.89]那模糊的人\n[01:06.19]我们有同样的默契\n[01:11.55]用天线\n[01:12.98]用天线排成爱你的形状hoho\n[01:20.81]在屋顶唱着你的歌\n[01:23.93]在屋顶和我爱的人\n[01:26.63]让星星点缀成最浪漫的夜晚\n[01:32.49]拥抱这时刻这一分一秒全都停止\n[01:40.74]爱开始纠结\n[01:42.94]在屋顶唱着你的歌\n[01:45.71]在屋顶和我爱的人\n[01:48.43]将泛黄的夜献给最孤独的月\n[01:54.31]拥抱这时刻这一分一秒全都停止\n[02:02.56]爱开始纠结梦有你而美\n[02:42.63]半夜睡不着觉把心情哼成歌\n[02:48.43]只好到屋顶找另一个梦境\n[02:59.17]睡梦中被敲醒我还是不确定\n[03:04.76]怎会有动人旋律在对面的屋顶\n[03:10.24]我悄悄关上门带着希望上去\n[03:15.71]原来是我梦里常出现的那个人\n[03:19.97]那个人不就是我梦里\n[03:22.76]那模糊的人\n[03:25.29]我们有同样的默契\n[03:30.66]用天线\n[03:32.16]用天线排成爱你的形状hoho\n[03:40.27]在屋顶唱着你的歌\n[03:43.18]在屋顶和我爱的人\n[03:45.86]让星星点缀成最浪漫的夜晚\n[03:51.86]拥抱这时刻这一分一秒全都停止\n[04:00.80]爱开始纠结\n[04:02.13]在屋顶唱着你的歌\n[04:04.94]在屋顶和我爱的人\n[04:07.59]将泛黄的夜献给最孤独的月\n[04:13.59]拥抱这时刻这一分一秒全都停止\n[04:21.85]爱开始纠结梦有你而美\n[04:37.70]让我爱你是谁\n[04:40.31]让你爱我是谁\n[04:43.16]怎会有动人旋律环绕在我俩的身边\n[04:48.39]让我爱你是谁\n[04:51.30]让你爱我是谁\n[04:54.00]原来是这屋顶有美丽的邂逅\n[05:04.50]在屋顶唱着你的歌\n[05:07.10]在屋顶和我爱的人\n", //LRC 歌词或者歌词文件的 URL
					pic: 'https://p1.music.126.net/vu3Cdo_dPq8HKOPI6_YXfA==/74766790689775.jpg', //封面图片 URL
					src: 'http://m701.music.126.net/20211122160045/5e6d097252350e68cfe94fe384eb3d7a/jdymusic/obj/w5zDlMODwrDDiGjCn8Ky/1670148397/9b0a/92d1/4841/fd8b17de7db32fc8bc3b2aba56b6b9f7.mp3' //音频文件的 URL
				},
				songsList:[
					{
						title: '予你', //歌曲名称
						artist: '队长', //演唱者
						lrc: "[00:00.000] 作词 : 周杰伦\n[00:01.000] 作曲 : 周杰伦\n[00:02.000] 编曲 : 屠颖\n[00:23.74]半夜睡不着觉把心情哼成歌\n[00:29.15]只好到屋顶找另一个梦境\n[00:40.10]睡梦中被敲醒我还是不确定\n[00:45.55]怎会有动人旋律在对面的屋顶\n[00:51.10]我悄悄关上门带着希望上去\n[00:56.43]原来是我梦里常出现的那个人\n[01:00.74]那个人不就是我梦里\n[01:03.89]那模糊的人\n[01:06.19]我们有同样的默契\n[01:11.55]用天线\n[01:12.98]用天线排成爱你的形状hoho\n[01:20.81]在屋顶唱着你的歌\n[01:23.93]在屋顶和我爱的人\n[01:26.63]让星星点缀成最浪漫的夜晚\n[01:32.49]拥抱这时刻这一分一秒全都停止\n[01:40.74]爱开始纠结\n[01:42.94]在屋顶唱着你的歌\n[01:45.71]在屋顶和我爱的人\n[01:48.43]将泛黄的夜献给最孤独的月\n[01:54.31]拥抱这时刻这一分一秒全都停止\n[02:02.56]爱开始纠结梦有你而美\n[02:42.63]半夜睡不着觉把心情哼成歌\n[02:48.43]只好到屋顶找另一个梦境\n[02:59.17]睡梦中被敲醒我还是不确定\n[03:04.76]怎会有动人旋律在对面的屋顶\n[03:10.24]我悄悄关上门带着希望上去\n[03:15.71]原来是我梦里常出现的那个人\n[03:19.97]那个人不就是我梦里\n[03:22.76]那模糊的人\n[03:25.29]我们有同样的默契\n[03:30.66]用天线\n[03:32.16]用天线排成爱你的形状hoho\n[03:40.27]在屋顶唱着你的歌\n[03:43.18]在屋顶和我爱的人\n[03:45.86]让星星点缀成最浪漫的夜晚\n[03:51.86]拥抱这时刻这一分一秒全都停止\n[04:00.80]爱开始纠结\n[04:02.13]在屋顶唱着你的歌\n[04:04.94]在屋顶和我爱的人\n[04:07.59]将泛黄的夜献给最孤独的月\n[04:13.59]拥抱这时刻这一分一秒全都停止\n[04:21.85]爱开始纠结梦有你而美\n[04:37.70]让我爱你是谁\n[04:40.31]让你爱我是谁\n[04:43.16]怎会有动人旋律环绕在我俩的身边\n[04:48.39]让我爱你是谁\n[04:51.30]让你爱我是谁\n[04:54.00]原来是这屋顶有美丽的邂逅\n[05:04.50]在屋顶唱着你的歌\n[05:07.10]在屋顶和我爱的人\n", //LRC 歌词或者歌词文件的 URL
						pic: 'https://p1.music.126.net/vu3Cdo_dPq8HKOPI6_YXfA==/74766790689775.jpg', //封面图片 URL
						src: 'http://m701.music.126.net/20211122160045/5e6d097252350e68cfe94fe384eb3d7a/jdymusic/obj/w5zDlMODwrDDiGjCn8Ky/1670148397/9b0a/92d1/4841/fd8b17de7db32fc8bc3b2aba56b6b9f7.mp3' //音频文件的 URL
					},
					{
						title: '致你', //歌曲名称
						artist: 'yihuik苡慧', //演唱者
						lrc: "[00:00.000] 作词 : 周萌\n[00:01.000] 作曲 : 郭子阳\n[00:13.795]制作人：关天天\n[00:15.789]出品：网易喜雨工作室×网易飓风工作室\n[00:18.299]恋恋不舍又念念不忘\n[00:22.290]被汹涌浪潮淹没\n[00:26.042]覆盖了属于我\n[00:28.294]最孤独的海洋\n[00:30.544]迷茫的 游荡\n[00:33.983]不知去往何方\n[00:35.235]\n[00:35.476]\n[00:35.994]支离破碎\n[00:37.984]或遍体鳞伤\n[00:39.981]研磨成匆匆过往\n[00:43.487]一幕幕的相逢\n[00:45.983]都不甘于平庸\n[00:48.234]原谅我 此番\n[00:51.743]不经意的设防\n[00:53.226]\n[00:53.739]跌跌宕宕\n[00:55.746]你占据我的遐想\n[00:57.979]封上你路过的窗\n[01:01.496]你的声音\n[01:03.490]来来往往\n[01:05.730]穿梭在无人演出的剧场\n[01:09.481]\n[01:10.241]若想念是凋谢的云\n[01:12.730]乘着风也飘向你\n[01:14.744]降落在你耳边低语\n[01:19.232]像沉默的打字机\n[01:21.496]满怀热烈情绪\n[01:23.988]写不出 会别离 太爱你\n[01:27.236]\n[01:27.483]到最后\n[01:28.174]我只好小心翼翼\n[01:30.671]尝试着偷偷靠近\n[01:32.419]触碰你那透明的心\n[01:36.919]猜你启封的表情\n[01:39.182]只敢写下开篇的\n[01:42.167]致你\n[01:45.921]\n[02:04.922]恋恋不舍又念念不忘\n[02:08.869]被汹涌浪潮淹没\n[02:12.365]覆盖了属于我\n[02:14.860]最孤独的海洋\n[02:17.357]迷茫的 游荡\n[02:20.617]不知去往何方\n[02:21.861]\n[02:22.114]\n[02:22.614]支离破碎\n[02:24.625]或遍体鳞伤\n[02:27.107]研磨成匆匆过往\n[02:30.359]一幕幕的相逢\n[02:32.874]都不甘于平庸\n[02:34.864]原谅我 此番\n[02:37.373]不经意的设防\n[02:39.566]\n[02:40.063]跌跌宕宕\n[02:42.073]你占据我的遐想\n[02:44.321]封上你路过的窗\n[02:47.819]你的声音\n[02:49.813]来来往往\n[02:52.056]穿梭在无人演出的剧场\n[02:56.564]\n[02:56.811]若想念是凋谢的云\n[02:59.056]乘着风也飘向你\n[03:01.315]降落在你耳边低语\n[03:05.576]像沉默的打字机\n[03:07.825]满怀热烈情绪\n[03:10.566]写不出 会别离 太爱你\n[03:13.561]\n[03:14.267]到最后\n[03:14.766]我只好小心翼翼\n[03:17.007]尝试着偷偷靠近\n[03:19.016]触碰你那透明的心\n[03:23.254]猜你启封的表情\n[03:25.510]只敢写下开篇的\n[03:28.529]致你\n[03:31.279]\n[03:32.264]若想念是凋谢的云\n[03:34.514]乘着风也飘向你\n[03:36.768]降落在你耳边低语\n[03:41.023]像沉默的打字机\n[03:43.523]满怀热烈情绪\n[03:46.279]写不出 会别离 太爱你\n[03:49.016]\n[03:49.515]到最后\n[03:50.513]我只好小心翼翼\n[03:52.262]尝试着偷偷靠近\n[03:54.517]触碰你那透明的心\n[03:58.762]猜你启封的表情\n[04:01.265]只敢写下开篇的\n[04:04.018]致你\n[04:07.011]\n[04:09.014]编曲：周智旭\n[04:10.505]钢琴：关天天\n[04:12.515]吉他：劳国贤\n[04:14.257]混音：侯春阳/刘城函\n[04:15.509]母带：侯春阳\n[04:16.770]和声：沙栩帆\n[04:18.005]监制：赵宗\n[04:19.016]企划：荆晓涵\n[04:20.020]统筹：陈铭\n[04:20.520]出品人：谢奇笛/姚政\n[04:21.520]推广：孙梦迪/徐思灵/孙鑫/二久\n[04:21.880]宣传：曹知青/吴松禹/苟苏铃\n[04:22.264]词曲统筹：NewP音乐\n[04:23.264]本歌曲来自网易喜雨工作室×飓风工作室\n", //LRC 歌词或者歌词文件的 URL
						pic: 'https://p2.music.126.net/6y-UleORITEDbvrOLV0Q8A==/5639395138885805.jpg', //封面图片 URL
						src: 'http://m704.music.126.net/20211122161229/522af0a5c468941a5defcaa12ebbc377/jdymusic/obj/wo3DlMOGwrbDjj7DisKw/10481875587/3525/5951/e436/5a9e3966c30e0d42aa3d958603994a09.mp3'
					},
					{
						title: '漠河舞厅', //歌曲名称
						artist: '杜选达', //演唱者
						lrc: '', //LRC 歌词或者歌词文件的 URL
						pic: 'https://p1.music.126.net/GhhuF6Ep5Tq9IEvLsyCN7w==/18708190348409091.jpg', //封面图片 URL
						src: 'http://m701.music.126.net/20211122160045/5e6d097252350e68cfe94fe384eb3d7a/jdymusic/obj/w5zDlMODwrDDiGjCn8Ky/1670148397/9b0a/92d1/4841/fd8b17de7db32fc8bc3b2aba56b6b9f7.mp3' //音频文件的 URL
					},
				],
			}
		},
		mounted() {
			console.log("this.musicListData===>");
			console.log(this.musicListData);
		},
		created() {
			this.$getRequest("https://netease-cloud-music-neon.vercel.app/artist/top/song?id=6452").then(res =>{
				console.log(res);
				for (let i = 0; i < res.songs.length; i++) {
					let title = res.songs[i].name
					let id = res.songs[i].id
					let picUrl = res.songs[i].picUrl
					let artist = "";
					if(res.songs[i].ar.length>0){
						artist = res.songs[i].ar.reduce((pre,currItem,arr) =>{
							return pre + currItem.name + ",";
						},"")
					}

					let songObj = {
						"title":title,
						"id":id,
						"pic":picUrl,
						"artist":artist,
					}
					this.musicListData.add(songObj);
				}
			}).then((resolve,reject)=>{
				this.musicListData.map((value,index,arr)=>{
					this.$getRequest("https://netease-cloud-music-neon.vercel.app/lyric?id="+value.id).then(res =>{
						value.lrc = res.lrc.lyric;
					})
				})
			}).then((resolve,reject)=>{
				this.musicListData.map((value,index,arr)=>{
					this.$getRequest("https://netease-cloud-music-neon.vercel.app/song/url?id="+value.id).then(res =>{
						value.url = res.data[0].url;
					})
				})
			})
		}
	}
</script>

<style scoped>

</style>
